In [ ]:
# http://www.ad.co.kr/stat/index.hjsp

In [10]:
# from scipy import stats

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
# import seaborn as sns|
%matplotlib inline

In [5]:
df2015 = pd.read_csv('../data/2015ad.csv')
df2015.head()

   Unnamed: 0  firm        tv   radio newpaper magazine
0           0   회사명        TV     라디오       신문       잡지
1           1  삼성전자  11479225  423815  6203885   242300
2           2    KT   8380633  368017   905887    25100
3           3  LG전자   6748621  342048  1969787   114800
4           4  한국지엠   6791838  596281   662799    35200

In [6]:
df2015.drop('Unnamed: 0', axis=1, inplace=True)

In [7]:
df2015.drop(0, inplace=True)

In [8]:
df2015.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99 entries, 1 to 99
Data columns (total 5 columns):
firm        99 non-null object
tv          99 non-null object
radio       99 non-null object
newpaper    99 non-null object
magazine    99 non-null object
dtypes: object(5)
memory usage: 4.6+ KB

In [9]:
df2015['tv'] = pd.to_numeric(df2015['tv'])
df2015['radio'] = pd.to_numeric(df2015['radio'])
df2015['newpaper'] = pd.to_numeric(df2015['newpaper'])
df2015['magazine'] = pd.to_numeric(df2015['magazine'])
df2015.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99 entries, 1 to 99
Data columns (total 5 columns):
firm        99 non-null object
tv          99 non-null int64
radio       99 non-null int64
newpaper    99 non-null int64
magazine    99 non-null int64
dtypes: int64(4), object(1)
memory usage: 4.6+ KB

In [10]:
df2015.set_index('firm', inplace=True)

In [11]:
# TV 광고액 상위 10개 기업을 추출..

In [12]:
df2015.sort_values('tv', ascending=False)[:10]

                 tv   radio  newpaper  magazine
firm
삼성전자       11479225  423815   6203885    242300
KT          8380633  368017    905887     25100
한국지엠        6791838  596281    662799     35200
LG전자        6748621  342048   1969787    114800
NHN엔터테인먼트   6455304  504860         0      1500
LGU플러스      5524647  358048     28231     25000
기아자동차       4784181  568812   1586957     58800
현대자동차       4453752  414230   2817550    108300
케이투코리아      3804675       0     84597     33000
한국인삼공사      3542698  169576    541614     25500

In [13]:
df2015['date'] = '201509'
df2015.head()

             tv   radio  newpaper  magazine    date
firm
삼성전자   11479225  423815   6203885    242300  201509
KT      8380633  368017    905887     25100  201509
LG전자    6748621  342048   1969787    114800  201509
한국지엠    6791838  596281    662799     35200  201509
현대자동차   4453752  414230   2817550    108300  201509

In [14]:
# df2015 ~ df2019 모든 파일을 처리하는 코드를 작성하시오..

In [24]:
df2015 = pd.read_csv('../data/2015ad.csv')
df2016 = pd.read_csv('../data/2016ad.csv')
df2017 = pd.read_csv('../data/2017ad.csv')
df2018 = pd.read_csv('../data/2018ad.csv')
df2019 = pd.read_csv('../data/2019ad.csv')

In [21]:
import os
for f in os.listdir('../data/')[3:8]:
    path = '../data/'
    df = pd.read_csv(path+f)
    print(df.head())
    print('-'*20)

   Unnamed: 0  firm        tv   radio newpaper magazine
0           0   회사명        TV     라디오       신문       잡지
1           1  삼성전자  11479225  423815  6203885   242300
2           2    KT   8380633  368017   905887    25100
3           3  LG전자   6748621  342048  1969787   114800
4           4  한국지엠   6791838  596281   662799    35200
--------------------
   Unnamed: 0    firm       tv   radio newpaper magazine
0           0     회사명       TV     라디오       신문       잡지
1           1    삼성전자  8571937  255932  6769684   223800
2           2   현대자동차  4929457  448627  2711580   115300
3           3  아모레퍼시픽  4563944  222294  1742959   987600
4           4    LG전자  5587791   72904  1298358   184400
--------------------
   Unnamed: 0   firm        tv   radio newpaper magazine
0           0    회사명        TV     라디오       신문       잡지
1           1   삼성전자  11668720  242469  7356007   391700
2           2   LG전자  13776012  322223  2679913   155700
3           3     KT   4768380  265896  1544589    22500
4           4  현대자동차   2837608  359010  1861762   119500
--------------------
   Unnamed: 0  firm        tv   radio newpaper magazine
0           0   회사명        TV     라디오       신문       잡지
1           1  LG전자  17908248   89237  1516482   160100
2           2  삼성전자  12279508  291138  6285213   268100
3           3    KT   3554634  168158  1717394    26000
4           4  삼성화재   2001163   63883  3183392    13600
--------------------
   Unnamed: 0  firm        tv   radio newpaper magazine
0           0   회사명        TV     라디오       신문       잡지
1           1  삼성전자   7597926  401512  7192464   289000
2           2  LG전자  12913571       0  1135883    62100
3           3  한화공동   6380516  120920   855486    60500
4           4    KT   4852147   67687  1993508    22300
--------------------

In [25]:
for i, df in enumerate([df2015, df2016, df2017, df2018, df2019]):
    df.drop('Unnamed: 0', axis=1, inplace=True)
    df.drop(0, inplace=True)
    df['tv'] = pd.to_numeric(df['tv'])
    df['radio'] = pd.to_numeric(df['radio'])
    df['newpaper'] = pd.to_numeric(df['newpaper'])
    df['magazine'] = pd.to_numeric(df['magazine'])
    df.set_index('firm', inplace=True)
    date = str(int(2015) + int(i)) +'.' + '09'
    df['date'] = date
    print(df.head())
    print('-'*20)

             tv   radio  newpaper  magazine     date
firm
삼성전자   11479225  423815   6203885    242300  2015.09
KT      8380633  368017    905887     25100  2015.09
LG전자    6748621  342048   1969787    114800  2015.09
한국지엠    6791838  596281    662799     35200  2015.09
현대자동차   4453752  414230   2817550    108300  2015.09
--------------------
             tv   radio  newpaper  magazine     date
firm
삼성전자    8571937  255932   6769684    223800  2016.09
현대자동차   4929457  448627   2711580    115300  2016.09
아모레퍼시픽  4563944  222294   1742959    987600  2016.09
LG전자    5587791   72904   1298358    184400  2016.09
KT      4792340  317334   1120930     33100  2016.09
--------------------
              tv   radio  newpaper  magazine     date
firm
삼성전자    11668720  242469   7356007    391700  2017.09
LG전자    13776012  322223   2679913    155700  2017.09
KT       4768380  265896   1544589     22500  2017.09
현대자동차    2837608  359010   1861762    119500  2017.09
한국인삼공사   3873921  298050    518108    170500  2017.09
--------------------
             tv   radio  newpaper  magazine     date
firm
LG전자   17908248   89237   1516482    160100  2018.09
삼성전자   12279508  291138   6285213    268100  2018.09
KT      3554634  168158   1717394     26000  2018.09
삼성화재    2001163   63883   3183392     13600  2018.09
현대자동차   2655603  480837   1782310     76700  2018.09
--------------------
            tv   radio  newpaper  magazine     date
firm
삼성전자   7597926  401512   7192464    289000  2019.09
LG전자  12913571       0   1135883     62100  2019.09
한화공동   6380516  120920    855486     60500  2019.09
KT     4852147   67687   1993508     22300  2019.09
대웅제약   6033183       0    351571      6000  2019.09
--------------------

In [27]:
df2018.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, LG전자 to 쿠쿠전자
Data columns (total 5 columns):
tv          100 non-null int64
radio       100 non-null int64
newpaper    100 non-null int64
magazine    100 non-null int64
date        100 non-null object
dtypes: int64(4), object(1)
memory usage: 4.7+ KB